!%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%!
!%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%!
! Módulo constantes:
!%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%!
!%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%!
module constantes
! use :: iso_fortran_env, only: sp=>real32, dp=>real64 !!!! Caso esteja em Fortran 2008+, utilize isto para sp, dp.
implicit none

! Declaração de variáveis do módulo:
    ! Variáveis que denotam precisão simples e dupla pelo método <=F90:
integer, parameter :: sp = selected_real_kind(6,37)    
integer, parameter :: dp = selected_real_kind(15,307)

! Declaração de rotinas do módulo (leitura das constantes, etc.):
contains
!**********************************************************************************************************************************!
subroutine const_sub()
!! Subrotina de teste.

! IN

! INOUT/OUT

! Local

! Execução
print("(A)"), "Teste"

end subroutine
!**********************************************************************************************************************************!

!**********************************************************************************************************************************!
subroutine const_sub2()
!! Subrotina de teste 2.

! IN

! INOUT/OUT

! Local

! Execução
print("(A)"), "Teste: sub2"

end subroutine
!**********************************************************************************************************************************!

end module constantes